import { StrictMode } from 'react'
import { createRoot } from 'react-dom/client'
import './index.css'
import App from './App.jsx'

if (!window.__framed_logged) {
  window.__framed_logged = true;
  console.log(`
███████╗██████╗  █████╗ ███╗   ███╗███████╗██████╗
██╔════╝██╔══██╗██╔══██╗████╗ ████║██╔════╝██╔══██╗
█████╗  ██████╔╝███████║██╔████╔██║█████╗  ██║  ██║
██╔══╝  ██╔══██╗██╔══██║██║╚██╔╝██║██╔══╝  ██║  ██║
██║     ██║  ██║██║  ██║██║ ╚═╝ ██║███████╗██████╔╝
╚═╝     ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝╚═════╝
By groundhelio 🦆
`);
}

createRoot(document.getElementById('root')).render(
  <StrictMode>
    <App />
  </StrictMode>,
)
